Repository: 84000/data-translation-memory
Catalog: toh181-v4.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་ཉན་ཐོས་ཀྱི་བསམ་གཏན་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བགྱིད་པ་རྣམས་དང་བྲལ་བ་ལགས།
en: So, Blessed One, why is the concentration of the hearers not the mind of omniscience?”

source: ཁྱོད་ཇི་ལྟར་བཟོད་པ་དེ་བཞིན་དུ་ལན་ཐོབ་ཅིག །
en: Bear with me as I give you a reply.

source: གང་པོ་འདི་ཇི་སྙམ་དུ་སེམས། གལ་ཏེ་ཉན་ཐོས་བསམ་གཏན་ལ་གནས་པ་ཡང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཆོས་ཉིད་གང་དང་ལྡན་པའི་ཆོས་ཉིད་དེ་མངོན་སུམ་དུ་བྱེད་ན། ཉན་ཐོས་དེ་ཡང་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱའམ།
en: Pūrṇa, tell me, if a hearer practices concentration and actualizes the suchness that is the suchness of the blessed buddhas, is that hearer called a ‘Thus-Gone One’?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་དེའི་ཕྱིར་ཁྱོད་ལ་དཔེར་བྱ་བ་བསྟན་ཏེ།
en: The Blessed One said, “Let me give you another analogy, Pūrṇa.

source: འདི་ན་མི་མཛངས་པ་ཁ་ཅིག་ནི་བཤད་པའི་དོན་དཔེས་རྟོགས་པར་འགྱུར་བས་ཁྱོད་ལ་དཔེ་བསྟན་པར་བྱའོ།
en: Since some dull-witted persons may understand what I am talking about by means of an analogy, let me use one.

source: །གང་པོ་དཔེར་ན། མི་ལ་ལ་ཞིག་རྒྱལ་པོའི་སྟན་ལ་འདུག་ན། གང་པོ་འདི་ཇི་སྙམ་དུ་སེམས། དེ་ཙམ་གྱིས་ན་མི་དེ་ཡང་རྒྱལ་པོ་ཞེས་བྱའམ།
en: Pūrṇa, if, for example, a normal person takes a seat on a royal throne, does that act in itself make him a king?”

source: བཅོམ་ལྡན་འདས་འདི་ལྟར་མི་དེ་ནི་རྒྱལ་པོའི་མཚན་རྣམས་དང་བྲལ་བའི་སླད་དུའོ།
en: Blessed One, because that man would still lack the characteristics of a king.”

source: ཉན་ཐོས་བསམ་གཏན་དང་པོ་ལ་མཉམ་པར་གཞོག་ཅིང་། བསམ་གཏན་གཉིས་པ་དང་། གསུམ་པ་དང་།
en: The hearers may rest in equipoise in the first concentration as well as the second, third, and fourth concentrations.

source: བཞི་པ་ལ་མཉམ་པར་གཞོག་གམ། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་ལ་མཉམ་པར་བཞག་སྟེ།
en: They may also rest in equipoise in the four attainments of the formless realm.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཆོས་ཉིད་གང་དང་ལྡན་པའི་ཆོས་ཉིད་དེ་མངོན་སུམ་དུ་བྱེད་དུ་ཟིན་ཀྱང་།
en: They may even have actualized the suchness that is the suchness of the blessed buddhas.

source: གང་པོ་ཉན་ཐོས་ལ་ནི་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་རྣམས་མེད་ལ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་དང་བྲལ་ཏེ།
en: However, Pūrṇa, the hearers do not possess the qualities of the Buddha, such as the ten powers and the four types of fearlessness, nor do they have omniscient wisdom.

source: ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོན་ཏན་གང་དག་དང་ལྡན་པའི་ཡོན་ཏན་དེ་དག་དང་བྲལ་བས་ན། དེ་བཞིན་གཤེགས་པའི་ཉན་ཐོས་ཞེས་བྱ་བའི་མིང་འཐོབ་བོ།
en: It is because they lack these qualities of the thus-gone, worthy, perfect Buddha that they are called ‘the Thus-Gone One’s hearers.’

source: །བསམ་གཏན་དེ་དག་ཀྱང་འདི་ལྟར་ཡོན་ཏན་དེ་རྣམས་དང་བྲལ་བ་ཡིན་ཏེ། བསམ་གཏན་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་བསམ་གཏན་རྣམས་ཀྱི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ། །སྟོང་གི་ཆ་དང་། འབུམ་གྱི་ཆ་དང་།
en: The hearers’ concentrations lack the qualities of the Buddha and they do not amount even to one percent of the concentrations of the bodhisattvas. Nor do they count for a thousandth or a hundred thousandth of that.

source: གང་པོ་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་ནི། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་ཡོངས་སུ་མ་སྤངས་པ་ཡིན་ལ། སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཡོངས་སུ་དག་པར་བྱེད་པའི་ཕྱིར་རོ།
en: Because, Pūrṇa, when bodhisattva great beings rest in the perfection of concentration, they do not lose sight of the state of omniscience and they purify the buddha realms.

source: །གནས་པ་འདིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་གནས་པ་གང་གི་གནས་པ་དང་། སྙོམས་པར་འཇུག་པ་གང་གིས་གནས་པ་ཡང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་མི་ཤེས་སོ།
en: As the bodhisattvas practice and rest in attainment in this way, there is no one among the hearers or solitary buddhas who can comprehend the way they practice and the way they rest in attainment.”

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་གནས་པ་འདིའི་མིང་ཅི་ཞེས་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Pūrṇa asked, “Blessed One, what is this practice of the bodhisattva great beings called?”

source: གང་པོ་བྱང་ཆུབ་སེམས་དཔའི་གནས་པ་འདིའི་མིང་ནི་གནས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཞེས་བྱའོ།
en: The Blessed One said, “Pūrṇa, this practice of the bodhisattvas is called ‘the inconceivable practice.’

source: གང་པོ་འདི་ལྟར་གནས་པ་འདི་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་འཐོབ་པའི་ཕྱིར་ཡང་དག་པར་འཇུག་པ་ཡིན་ནོ།
en: Pūrṇa, it is called this since this practice brings about the qualities of omniscience.

source: །གང་པོ་དེ་ལྟ་བས་ན་གནས་པ་དེའི་མིང་ནི་འཇིག་རྟེན་ཐམས་ཅད་ལ་ཕན་པར་འདོད་པའི་གནས་པ་ཞེས་བྱའོ།
en: Pūrṇa, therefore this practice is also called ‘the practice that aims to benefit all worlds.’

source: གང་པོ་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་ཆེད་དུ་གནས་པ་འདི་ལ་མཉམ་པར་འཇོག་སྟེ།
en: Because, Pūrṇa, the bodhisattva great beings rest in equipoise in this practice for the sake of limitless beings.

source: གནས་པ་འདི་དག་གིས་གནས་པ་གང་ཡིན་པ་དེ་ནི། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ན། སེམས་ཅན་དཔག་ཏུ་མེད་ཅིང་གྲངས་མེད་པ་རྣམས་ལ་ཟག་པ་མེད་པའི་བསམ་གཏན་རྣམས་ཀྱིས་འདོམས་ཤིང་རྗེས་སུ་སྟོན་ཏེ་འདུལ་བར་འགྱུར་རོ།
en: It is due to this practice of resting that the bodhisattvas, as they awaken to unsurpassed and perfect buddhahood, attain the undefiled concentrations that allow them to instruct, teach, and guide limitless and endless beings.

source: །གང་པོ་རྣམ་གྲངས་འདིས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གནས་པ་གང་གིས་གནས་པའི་གནས་པ་འདིའི་མིང་འཇིག་རྟེན་ཐམས་ཅད་ལ་ཕན་པར་འདོད་པ་ཞེས་བྱ་སྟེ།
en: Pūrṇa, in this way, this practice of resting by which the bodhisattva great beings practice is called ‘the practice that aims to benefit all worlds.’

source: གང་པོ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །འདི་ལྟར་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་ཡང་བྱའོ།
en: Pūrṇa, in this way, since the bodhisattva great beings seek to awaken to unsurpassed and perfect buddhahood, they must train in the perfection of concentration and accomplish the perfection of concentration.”

source: །བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ལེའུ་གསུམ་པའོ།། །།
en: This is the third chapter from “The Perfection of Concentration.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཉན་ཐོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྙོམས་པར་འཇུག་པ་རྣམས་ལས་ཁྱད་པར་དུ་འཕགས་པ་ལགས་སོ།
en: Venerable Pūrṇa Maitrāyaṇīputra said to the Blessed One, “Blessed One, compared to the attainments of the bodhisattvas, those of the hearers are more exalted.

source: བཅོམ་ལྡན་འདས་འདི་ལྟར་ཉན་ཐོས་ནི་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་མཉམ་པར་འཇོག་ལ། བྱང་ཆུབ་སེམས་དཔའ་ནི་སྙོམས་པར་འཇུག་པ་བརྒྱད་ལ་མཉམ་པར་འཇོག་སྟེ།
en: Blessed One, that is because the hearers have nine gradual attainments whereas the bodhisattvas only rest in eight attainments.

source: དེས་ན་ཉན་ཐོས་ཀྱི་ཏིང་ངེ་འཛིན་ནི་གཅིག་གིས་ལྷག་སྟེ། དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ལས་ཉན་ཐོས་སྙོམས་པར་འཇུག་པས་ཁྱད་ཞུགས་པ་ལགས་སོ། །
en: In this way the hearers have one more absorption, and so, compared to the bodhisattvas, the hearers are superior in terms of their attainments.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཡང་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ཡོད་དོ།
en: When he had said this, the Blessed One replied to Pūrṇa Maitrāyaṇīputra, “Pūrṇa, the bodhisattvas also have the attainment of the state of cessation.

source: །གང་པོ་བྱང་ཆུབ་སེམས་དཔས་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་དབང་ཐོབ་མོད་ཀྱི། མཉམ་པར་གཞོག་པར་ནི་མི་བྱེད་དོ།
en: Pūrṇa, although bodhisattvas certainly master the attainment of the state of cessation, they do not enter that attainment.

source: ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་སར་ལྷུང་དུ་དོགས་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་གནང་བར་མ་མཛད་དོ།
en: Because the thus-gone, worthy, perfect Buddha does not grant his permission, fearing that they would fall into the levels of the hearers or the solitary buddhas.

source: །གང་པོ་དེའི་ཕྱིར་ཁྱོད་ལ་དཔེས་བསྟན་པར་བྱ་སྟེ། འདི་ན་མི་མཛངས་པ་ལ་ལ་དཔེ་བསྟན་པས་བཤད་པའི་དོན་རྟོགས་པར་འགྱུར་རོ།
en: Pūrṇa, let me provide you some analogies for this, since some dull-witted people may better understand this point by means of an analogy. “

source: །གང་པོ་དཔེར་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཡང་ཡུལ་མཐའ་འཁོབ་ཕྱོགས་ཀྱི་རྒྱལ་ཕྲན་མང་པོ་དག་པས་ཆེ་ལ།
en: Pūrṇa, as an analogy, a universal monarch is greater than the many petty rulers in the outlying districts.

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དེ་བདག་ཉིད་དེར་མི་འགྲོ་ཞིང་། ས་ཕྱོགས་དེར་གནས་པར་ཡང་མི་བྱེད་མོད་ཀྱི། འོན་ཀྱང་ཡུལ་ཕྱོགས་དེ་དག་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དེ་ཤེས་ཤིང་། ཡུལ་གྱི་མི་དེ་དག་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དེ་ཉིད་ཀྱི་བཀའ་ཉན་ཏེ།
en: Although the universal monarch does not travel to those places himself and even though he does not live there, he reigns in those countries and the people of those areas abide by his command.

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དེའི་ཡུལ་ན་འཁོད་དོ།
en: In this way the universal monarch is in control of his realm.

source: །གང་པོ་དེ་བཞིན་དུ་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འདུ་ཤེས་དང་ཚོར་བ་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་ཡང་མི་འཇོག་ལ། བྱང་ཆུབ་སེམས་དཔས་སྙོམས་པར་འཇུག་པ་དེ་ལ་དབང་ཡང་ངེས་པར་ཐོབ་སྟེ།
en: Pūrṇa, likewise, bodhisattva great beings do not enter the attainment in which perceptions and feelings have ceased and yet they have full control over that attainment.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་ནམ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པར་མ་གྱུར་གྱི་བར་དུ་ཏིང་ངེ་འཛིན་དེ་ལ་མཉམ་པར་བཞག་པའི་དུས་མ་ཡིན་ནོ།
en: It is only when bodhisattvas take their place at the seat of awakening that the time is right for them to rest in that absorption.

source: ཉན་ཐོས་ཉིད་དུ་གནས་པར་འགྱུར་དུ་འོང་བ་དང་། ཉན་ཐོས་ཀྱི་ས་གནོན་པར་འགྱུར་དུ་འོང་བ་དང་། ཉན་ཐོས་རྣམས་དང་མཉམ་པར་འགྱུར་དུ་དོགས་པའི་ཕྱིར་རོ།
en: Because otherwise they fear abiding in the state of a hearer, or remaining at the level of a hearer, or becoming like a hearer. “

source: །གང་པོ་དཔེར་ན་རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་ཚོང་འདུས་སུ་སོང་སྟེ། ཆང་གི་བཏུང་བ་འཐུང་འདོད་པར་གྱུར་ན། དེའི་བློན་པོ་མཁས་པའི་རང་བཞིན་ཅན་དག་འདི་སྐད་དུ་ལྷ་སྐྱེམས་གསོལ་བའི་དུས་འདི་མ་ལགས་སོ།
en: Pūrṇa, as another analogy, when a king, who has been crowned within the royal family, visits a market and expresses the wish to have a drink of wine, a skilled chamberlain will tell him, ‘Your Majesty, this is not a suitable time to drink.

source: །སྐབས་འདི་མ་ལགས་ཏེ།
en: It is not the proper occasion.

source: གང་གི་ཚེ་ལྷ་བཙུན་མོའི་འཁོར་དུ་གཤེགས་པ་དེའི་ཚེ་སྐྱེམས་གསོལ་བའི་དུས་ལགས་སོ། །ཞེས་ཟེར་རོ། །
en: Instead, Your Majesty, you should enjoy your drink when you visit the royal harem.’

source: གང་པོ་འདི་ཇི་སྙམ་དུ་སེམས། ཆང་གི་བཏུང་བ་དེ་རྒྱལ་པོ་ལ་མེད་དམ།
en: Now, Pūrṇa, tell me, does the king not have any wine to drink?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་མཆིས་སོ།
en: Pūrṇa said, “Yes, Blessed One, he does.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ལ་ཆང་གི་བཏུང་བ་ཡོད་མོད་ཀྱི། བློན་པོ་རྣམས་ཀྱིས་འཐུང་དུ་མི་སྟེར་རོ།
en: The Blessed One said, “The king certainly does have wine that he could drink, but the chamberlain does not give him any.

source: དེ་ནི་གྲོང་ཁྱེར་མང་པོ་དང་གྲོང་ཁྱེར་བརྒྱ་ཕྲག་མང་པོ་དང་། ཡུལ་མང་པོ་དང་མི་འབུམ་ཕྲག་མང་པོ་དག་གི་རྗེ་ཡིན་པས་ན། དེ་ཚོང་འདུས་ཀྱི་ནང་དུ་ཆང་འཐུང་བ་མི་རིགས་པའི་ཕྱིར་རོ།
en: Because, as the ruler of many hundreds of cities as well as many regions with several hundreds of thousands of people, it would not be proper for him to drink wine in the middle of a marketplace.

source: །གང་པོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ཤེས་པ་གང་དང་ལྡན་ན། འདུ་ཤེས་དང་ཚོར་བ་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་འཇོག་པའི་ཤེས་པ་ཡོད་མོད་ཀྱི། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་དེ་ལ་གནང་བར་མི་མཛད་དོ།
en: Pūrṇa, likewise, with the consciousness that bodhisattva great beings possess, they certainly do have the capacity to rest in the attainment of the cessation of perceptions and feelings, yet the blessed buddhas do not grant them permission.

source: རེ་ཞིག་འདུ་ཤེས་དང་ཚོར་བ་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་བཞག་པའི་དུས་མ་ཡིན་ཞིང་། སྐབས་མ་ཡིན་པའི་ཕྱིར་རོ།
en: Because for the time being this is not the proper context or occasion to rest in the attainment of the cessation of perceptions and feelings.

source: །གང་པོ་གང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདུ་ཤེས་ཐམས་ཅད་དང་། མཚན་མ་ཐམས་ཅད་སྤང་བའི་ཕྱིར་བདུད་རྩིའི་དབྱིངས་མངོན་སུམ་དུ་བྱས་ནས་འདུ་ཤེས་དང་ཚོར་བ་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་བཞག་སྟེ།
en: Pūrṇa, the bodhisattva great beings eventually will rest in the attainment of the cessation of perceptions and feelings, when they have abandoned all perceptions and all conceptuality and thus actualize the sphere of immortality.

source: གནས་པར་འགྱུར་བའི་དུས་དེ་དང་། སྐབས་དེ་ནི་ཕྱིས་འོང་བར་འགྱུར་ཏེ། གང་གི་ཚེ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པར་འགྱུར་བ་དེ་ནི་དེའི་དུས་དང་དེའི་སྐབས་ཡིན་ནོ།
en: However, that time and occasion will come in the future at the time and occasion when they sit at the seat of awakening.

source: །འདུ་ཤེས་ཐམས་ཅད་ལས་ཡང་དག་པར་འདའ་བར་བྱ་བའི་ཕྱིར་འདུ་ཤེས་དང་ཚོར་བ་འགོག་པའི་སྙོམས་པར་འཇུག་པ་བསྒྲུབས་ཏེ།
en: Because they then transcend all perceptions, they accomplish the attainment of the cessation of perceptions and feelings.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། ཆོས་ཀྱི་འཁོར་ལོ་རྣམ་པ་བཅུ་གཉིས་པ་བསྐོར་བར་འགྱུར་རོ།
en: As they thus awaken to unsurpassed and perfect buddhahood, they turn the wheel of Dharma with its twelve features.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ཙམ་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ལྟར་ཟག་པ་ཟད་པ་མངོན་སུམ་དུ་བགྱིད་པ་ལ་མཐུ་མཆིས་ཤིང་། སྟོབས་དང་ལྡན་ལ། མངོན་སུམ་དུ་ཡང་མི་བགྱིད་པ་ནི་དཀའ་བ་བགྱིད་པ་ལགས་ཏེ། ངོ་མཚར་ལགས་སོ།
en: When the Blessed One had spoken thus, Venerable Pūrṇa Maitrāyaṇīputra said to the Blessed One, “Blessed One, bodhisattva great beings have the strength and power to actualize the exhaustion of defilements, yet they do not actualize that state. It is amazing that they have such forbearance!

source: བཅོམ་ལྡན་འདས་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་རྣམས་ལ་ཡུན་རིང་པོར་ཕན་པ་དང་། ལྷག་པའི་བསམ་པས་ཉེ་བར་གནས་པའི་སླད་དུའོ།
en: Blessed One, this is so that they can act altruistically to benefit others for a long time.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་དེ་དེ་བཞིན་ནོ།
en: The Blessed One said, “Pūrṇa, that is correct.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དོན་གྱི་དབང་འདི་ཡང་དག་པར་མཐོང་ནས། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་འདི་དག་ལ་མཉམ་པར་མི་འཇོག་གོ།
en: When bodhisattva great beings perceive the implications of doing so, they will not rest in these gradual states of attainment.

source: གང་པོ་སྙོམས་པར་འཇུག་པ་འདི་དག་ལ་དབང་ཡང་ཐོབ་ལ། མཉམ་པར་ཡང་མི་འཇོག་པ་གང་ཡིན་པ་དེ་ཉིད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐབས་མཁས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Because, Pūrṇa, the skill of bodhisattva great beings entails mastering these attainments without resting in them.

source: །གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའམ། ཕྱིར་མི་ལྡོག་པ་ཡང་རུང་སྟེ། གང་ལ་ལ་དག་གིས་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་འདི་ལྟར་གནས་པར་བྱས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱའོ།
en: Whether one is a bodhisattva who has newly entered this vehicle, or a bodhisattva who has become nonregressing, it is by practicing the perfection of concentration in this manner that one is known as a bodhisattva.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཇི་ལྟར་གནས་པར་བགྱི།
en: Venerable Śāradvatīputra asked the Blessed One, “Blessed One, how do bodhisattva great beings practice the perfection of concentration?

source: ཇི་ལྟར་བསམ་གཏན་ལ་མཉམ་པར་བཞག་པར་བགྱི།
en: How do they rest in equipoise in concentration?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདོད་པ་དག་ལས་དབེན་པ། སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་པ། རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན། བསམ་གཏན་དང་པོ་བསྒྲུབས་ཏེ་གནས།
en: The Blessed One said, “Śāradvatīputra, when bodhisattvas are free of desire and unwholesome wrongdoing, possess conceptual and discursive thought, and enjoy the happiness that arises from such freedom, then they can accomplish and rest in the first concentration.

source: དེ་བཞིན་དུ་བསམ་གཏན་གཉིས་པ་དང་། གསུམ་པ་དང་། བཞི་པ་བསྒྲུབས་ཏེ་གནས།
en: In the same way they accomplish and rest in the second, third, and fourth concentrations.

source: ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་བསྒྲུབས་ཏེ་གནས་ཤིང་།
en: Thus they also accomplish and rest in the attainments of the field of limitless space, the field of limitless consciousness, the field of nothing whatsoever, and the field of neither perception nor non-perception.

source: དེ་གཟུགས་ན་སྤྱོད་པ་དང་། གཟུགས་མེད་པ་ན་སྤྱོད་པའི་བསམ་གཏན་དང་། སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་བཞག་སྟེ།
en: Thus, they rest in the concentrations and attainments related to the form and formless realms.

source: དེ་ལ་འདྲིས་པར་བྱས་ཤིང་། དེ་ལ་རྩེ་བར་བྱས་ནས་ཕྱིར་ཡང་འདོད་པའི་ཁམས་སུ་སེམས་གློན་པར་བྱེད་དོ།
en: However, once they have become acquainted with and reveled in these states, they once again turn their attention to the desire realm.

source: གཟུགས་ན་སྤྱོད་པ་དང་། གཟུགས་མེད་པ་ན་སྤྱོད་པའི་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་དུ་དོགས་པའི་ཕྱིར་ཏེ།
en: Due to fear of taking birth among the gods of the form or formless realms.

source: གཟུགས་དང་གཟུགས་མེད་པ་ན་སྤྱོད་པའི་བསམ་གཏན་རྣམས་ལ་མཉམ་པར་གཞོག་ན། དེར་ཉིང་མཚམས་སྦྱོར་བར་བྱེད་པས་ན། དེ་ལས་སེམས་སྲུང་བར་བྱེད་དེ། དེར་སྐྱེ་བ་ལས་ཕྱིར་ཟློག་པར་བྱེད་དོ། །
en: By resting in the concentrations of the form or formless realms, one may take rebirth there, and therefore one should be on guard to prevent that by turning away from such rebirths.

source: གཟུགས་ན་སྤྱོད་པ་དང་། གཟུགས་མེད་པ་ན་སྤྱོད་པའི་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་ན། སྐྱེ་བོ་སྟོང་ཕྲག་མང་པོ་དག་མགུ་བར་མི་འགྱུར་ཞིང་། སངས་རྒྱས་མཐོང་བ་དང་། སངས་རྒྱས་སུ་སྦྱོར་བ་ལས་ཤིན་ཏུ་ཕྱི་རོལ་ཏུ་འགྱུར་དུ་དོགས་པ་དང་།
en: Thus, skillful bodhisattvas should tell themselves, ‘If I am born among the gods of the form or formless realms, many thousands of beings will be displeased and I risk becoming far removed from any vision of, or meeting with, the Buddha.

source: གླེན་པའི་གནས་དག་ཏུ་སྐྱེས་ཏེ། གླེན་པའི་སྐྱེ་བ་ཡོངས་སུ་འཛིན་པར་འགྱུར་དུ་འོང་ངོ་སྙམ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་མཁས་པས་གཟུགས་དང་། གཟུགས་མེད་པ་ན་སྤྱོད་པའི་སྙོམས་པར་འཇུག་པ་དེ་དག་ཐོབ་ནས་དེ་ལ་འདྲིས་པར་བྱས་ཏེ། ཕྱིར་ཡང་ཐབས་ལ་མཁས་པས་འདོད་པའི་ཁམས་སུ་ཉིང་མཚམས་སྦྱོར་བར་བྱེད་དོ།
en: I will be born as a senseless being in a place of senseless beings.’ Thinking in this way allows the bodhisattvas skillfully to attain the attainments of the form and formless realms and become familiar with them, while, also due to their skillful means, once again taking rebirth in the desire realm. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན། མི་ཞིག་རྒྱལ་པོའི་བཙུན་མོ་དང་ལྷན་ཅིག་གནས་པར་འདོད་པ་དེ་འདི་སྙམ་དུ་ཐབས་ཇི་ལྟར་བྱས་ན།
en: Śāradvatīputra, suppose a man wishes to sleep with one of the king’s consorts.

source: རྒྱལ་པོའི་བཙུན་མོ་དམ་པ་དང་ལྷན་ཅིག་གནས་པར་བྱ། རྒྱལ་པོས་ཀྱང་མི་ཚོར་ལ། རྒྱལ་པོའི་མི་དག་གིས་ཀྱང་མི་ཚོར་ཞིང་།
en: He may then ponder, ‘How can I sleep with the chief royal consort without the king and his assistants finding out?

source: ཉེ་ཞོ་མེད་པར་ཕྱིར་ཡང་འགྲོ་བར་བྱ་སྙམ་དུ་སེམས་ཏེ།
en: And how can I safely slip away afterward?’

source: དེ་ཐབས་མཁས་པས་སྨན་གང་གིས་མི་དེའི་ཕོ་མཚན་མེད་པར་འགྱུར་བ་དེ་ལྟ་བུ་བཙལ་ནས།
en: Being a skilled person, he will then search for a medicinal remedy that temporarily removes his male organ.

source: དེ་ཕོ་མཚན་མེད་པར་རྒྱལ་པོ་དེ་དང་འདྲིས་པར་བྱས་ཏེ། རྒྱལ་པོ་དེ་ལ་ཡང་འདི་སྐད་དུ། ལྷ་མཁྱེན་པར་མཛད་དུ་གསོལ།
en: Having found such a remedy, he can then approach the king without a male organ and say, ‘Your Majesty, please listen to me!

source: བདག་གི་ཕོ་མཚན་མ་མཆིས་པར་གྱུར་ཏེ། བདག་མ་རུངས་པར་གྱུར་གྱིས་ལྷའི་བཙུན་མོའི་འཁོར་བསྲུང་བར་འཚལ་ལོ་ཞེས་གསོལ་ནས།
en: I have no male organ and because of this unfortunate situation I request the position of guarding Your Majesty’s royal harem.’

source: དེ་རྒྱལ་པོ་དེས་བརྟགས་ཏེ། བཙུན་མོའི་འཁོར་དུ་བཏང་ངོ་།
en: Having verified this, the king may then assign the man to his harem.

source: །བཏང་ནས་ཀྱང་མི་དེས་སྨན་གང་གིས་ཕོ་མཚན་འབྱུང་བར་འགྱུར་བ་དེ་ཟོས་ནས། དེ་རྒྱལ་པོའི་བཙུན་མོ་དམ་པ་དང་ཟླ་བ་གཅིག་གམ། གཉིས་སམ། གསུམ་གྱི་བར་དུ་ལྷན་ཅིག་གནས་ནས།
en: Once in the harem, the man can then apply another remedy that makes his male organ reappear, thus enabling him to sleep with the chief royal consort for one, two, or even three months straight.

source: དེ་འདི་སྙམ་དུ་གལ་ཏེ་བདག་རྒྱལ་པོས་ཚོར་ན་གདོན་མི་ཟ་བར་སྲོག་དང་བྲལ་བར་བྱེད་ཀྱིས།
en: However, at that point the man might begin to worry, thinking, ‘If the king finds out about this, he will surely have me killed!

source: བདག་ཕྱིར་ཡང་རྒྱལ་པོའི་ཕོ་བྲང་འདི་ནས་ཉེ་ཞོ་མེད་པ་དང་། བདེ་བར་འགྲོ་བར་བྱའོ་སྙམ་དུ་སེམས་ཏེ།
en: So, I must find a way to escape surely and safely from this royal palace.’

source: དེས་རྒྱལ་པོ་དེ་ལ་ལྷ་མཁྱེན་པར་མཛད་དུ་གསོལ། བདག་གི་ཕོ་མཚན་ཡང་སླར་བྱུང་གིས།
en: He will then address the king once more, saying, ‘Your Majesty, please listen to me!

source: ལྷའི་བཙུན་མོའི་འཁོར་ནས་བདག་སླར་མཆིའོ་ཞེས་གསོལ་ཏོ།
en: My male organ has suddenly reappeared and so it is no longer fitting that I remain in Your Majesty’s royal harem.’

source: །དེ་ནས་རྒྱལ་པོ་དེ་འདི་སྙམ་དུ། ཀྱེ་མ་མི་འདི་འདི་ལྟར་འོངས་ནས་གཡོ་མེད་པར་ངའི་བཙུན་མོའི་འཁོར་དང་ལྷན་ཅིག་འདུག་པ་གང་ཡིན་པ་དེ་ནི་དགེ་བ་ཞིག་ཡིན་ནོ་སྙམ་སེམས་ཏེ།
en: The king will then think to himself, ‘Oh, this is certainly a virtuous man! Since he arrived here, he has lived in my harem in such an honorable manner!’

source: རྒྱལ་པོས་དེ་ལ་ལུས་ལ་བགོ་བ་བྱིན་ཞིང་། སྦྱིན་པ་བྱིན་ནས་བཏང་ངོ་།
en: The king will then reward the man with fine clothing and gifts before finally letting him go.

source: །དེ་ལྟར་ཐབས་ལ་མཁས་པ་དང་། སྨན་ལ་མཁས་པས་རྒྱལ་པོའི་བཙུན་མོའི་འཁོར་སུན་ཕྱུང་ནས། ཕྱིར་ཡང་འདི་ལྟར་སྨན་གྱི་ཡོན་ཏན་དང་། འདི་ལྟར་ཐབས་མཁས་པའི་ཕྱིར་དེ་ཐབས་མཁས་པས་ཉེ་ཞོ་མེད་པར་ཕྱིར་སོང་ངོ་།
en: Due to his skillfulness and knowledge of medicinal remedies, at first he was able to infiltrate the royal harem and later, again because of medicinal remedies and his skills, he managed to get out without any suffering any harm. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་ལ་མཁས་པ་ནི། བསམ་གཏན་དང་པོ་ཐོབ་ནས་མཉམ་པར་གཞོག་གོ། །བསམ་གཏན་གཉིས་པ་དང་། གསུམ་པ་དང་། བཞི་པ་ཐོབ་ནས་མཉམ་པར་གཞོག་གོ།
en: Śāradvatīputra, likewise, skillful bodhisattva great beings attain and rest in the first concentration as well as the second, third, and fourth concentrations.

source: །ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་ཐོབ་ནས་མཉམ་པར་འཇོག་སྟེ།
en: They also attain and rest in the attainments of the field of limitless space, the field of limitless consciousness, the field of nothing whatsoever, and the field of neither perception nor non-perception.

source: དེ་ལ་འདྲིས་པར་བྱས་ནས། ཐབས་མཁས་པས་ཕྱིར་ཡང་འདོད་པའི་ཁམས་སུ་བབས་ཏེ།
en: Once they have gained familiarity with these states, they skillfully descend to the desire realm once again.

source: འདོད་པའི་ཁམས་ལ་དམིགས་ཤིང་། དེ་སངས་རྒྱས་མཐོང་བ་དང་། སངས་རྒྱས་ལ་བསྙེན་བཀུར་བྱ་བ་དང་ཡང་འབྲལ་བར་མི་འགྱུར་ལ།
en: As they focus on the desire realm, they are able to constantly behold and serve the Buddha.

source: ཡང་དག་པའི་མཐའ་ཡང་མངོན་སུམ་དུ་མི་བྱེད་དོ།
en: They also avoid manifesting the limit of reality.

source: འདི་ལྟར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་མ་སྤངས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མ་སྤངས་པའི་ཕྱིར་རོ།
en: Because in this way they do not abandon the state of omniscience, nor do they abandon any sentient being.
